var user = {     
     id: "",
     name: "Marharyta", 
     age: 18, 
     email: "l",
     city: "",
     phone:""
}  
var 

//  Создать объект user с свойствами id, name, age, email, city, ... и можно добавить еще что то на свое усмотрение.
//  Создать метод объекта который выводит в существующий блок на странице все данные пользователя ввиде карточки.
//  HTML карточки и стили к нему можно написать и оформить в произвольном виде.
//  Метод объекта должен принимать айди того блока в который нужно выводить данные о пользователе. user.render("user-card");
//  Для вставки html можно использовать innerHTML
//  Для написания стилей карточки пользователя нужно использовать файл style.css
//  Для поиска элементов использовать document.querySelector("#id_name");

